Autodesk.Revit.DB.NestedFamilyTypeReference.TypeName
Type of the referenced family
Since:
2016

Autodesk.Revit.DB.NestedFamilyTypeReference.FamilyName
Name of the referenced family
Since:
2016

Autodesk.Revit.DB.NestedFamilyTypeReference.CategoryId
Category Id of the referenced family
Since:
2016

Autodesk.Revit.DB.NestedFamilyTypeReference
A proxy element representing a nested family type.
Remarks:
This element represents a value of a FamilyType Parameter of a Loaded Family.
Each such element corresponds to a nested FamilyType Element in the original
Family Document where the family was defined.
This element stores only basic information about the nested FamilyType,
such as the name of the Type, name of the Family, and a Category.
These elements are very low-level and thus bypassed by standard element
filters. However, it is possible to obtain a set of applicable elements
of this class for a FamilyType parameter of a family by calling
Autodesk::Revit::DB::Family::GetFamilyTypeParameterValues
Since:
2016